import { data } from '../db/data';

function Instructions() {
  const dataKeys = Object.keys(data);
  return (
    <div className="min-h-screen flex flex-col items-center justify-center bg-gray-100 p-4 rounded-2xl">
      <div className="bg-white shadow-2xl rounded-2xl p-6 w-full max-w-2xl">
        <h1 className="text-2xl font-bold text-center mb-6">Инструкции за използване на приложението</h1>
        <div className="space-y-4">
          <p className="text-lg">
            1. Въведете името на града, от/за който да бъде организирана пратката, в полето "Град".
          </p>
          <p className="text-lg">
            2. Ако градът е на не повече от 30км от Варна, маркирайте опцията "област".
          </p>
          <p className="text-lg">
            3. В момента обслужваме следните градове: {dataKeys.join(', ')}. Избирате града от падащото меню.
          </p>
          <p className="text-lg">
            4. Въведете броя на палетите в полето "Брой палета". Броят трябва да бъде цяло число.
          </p>
          <p className="text-lg">
            5. Въведете общото тегло на пратката в килограми в полето "Общо килограми".
          </p>
          <p className="text-lg">
            6. Въведете височината на палетите в сантиметри в полето "Височина на пале (см)".
          </p>
          <p className="text-lg">
            7. Натиснете бутона "Изчисли цена", за да получите цената на пратката.
          </p>
          <p className="text-lg">
            8. Цената ще се покаже в секцията "Цена на пратката".
          </p>
          <p className="text-lg">
            9. За стоки със специфични условия, моля пишете на имейл: <a href="mailto:office-varna@gopettrans.com" className="text-indigo-600 underline">office-varna@gopettrans.com</a>.
          </p>
          <p className="text-lg">
            10. Получената цена е за евро палет с размери 120см/80см.
          </p>
          <p className="text-lg">
            11. Височината на палета не трябва да бъде повече от 2,4м. Ако е по-високо, се взима следващата по-висока цена.
          </p>
          <p className="text-lg">
            12. Тонажът на едно пале трябва да бъде около 500кг.
          </p>
          <p className="text-lg">
            13. Цените са без такса за ТРО. Цената за ТРО е 2,2 евро.
          </p>
          <p className='text-red-600 font-medium text-xl'> 14. Всички тарифи подлежат на препотвърждение от регионалния офис в гр. Варна.
            Запазваме правото си да предложим алтернативна оферта при необходимост.
          </p>
        </div>
        <h2 className="text-2xl font-bold text-center mt-8 mb-4">Условия за Доставка</h2>
        <ul className="list-disc list-inside space-y-2 text-lg">
          <li>Предизвестие за заявка 1 работен ден!</li>
          <li>Срок доставка: 24 часа *Следващ работен ден!</li>
          <li>Доставки с фиксиран час се таксуват допълнително и е задължително предизвестие от 2 работни дни!</li>
          <li>Доставки в извън работно време (08:00 - 18:00) се таксуват допълнително!</li>
          <li>Офертата е валидна при адреси с достъп на камиони, извън пешеходни зони / централни части и такива със спец. организация на движение!</li>
          <li>Товаро-разтоварване от шофьора не е включено в офертата и таксува след потвърждение от служител на Гопет Транс ЕООД!</li>
          <li>Офертата е валидна за безопасни товари, без митнически режим и обмитяване!</li>
          <li>Свободно време за товарене и доставка: 1 час!</li>
        </ul>
      </div>
    </div>
  );
}

export default Instructions;